import svg_1 from '@/../public/why-are-we/Frame 1171275782.svg'
import svg_2 from '@/../public/why-are-we/Frame 1171275782 (1).svg'
import svg_3 from '@/../public/why-are-we/Frame 1171275782 (2).svg'
import svg_4 from '@/../public/why-are-we/Frame 1171275782 (3).svg'
import svg_5 from '@/../public/why-are-we/Frame 1171275782 (4).svg'
import svg_6 from '@/../public/why-are-we/Frame 1171275782 (5).svg'

export const number = {
  phone: 74951800410,
  wa: 79031119466,
  phoneMask: "+7 (495) 180-04-10",
};

export const config = {
  enablePreloader: true, // Toggle preloader on/off
};

export const navItems = [
  {
    title: "Каталог",
    href: "/#catalog",
  },
  {
    title: "Проекты",
    href: "/#projects",
  },
  {
    title: "Преимущества",
    href: "/#advantages",
  },
  {
    title: "Дизайнерам",
    href: "/cooperation",
  },
  {
    title: "Производство",
    href: "/#productions",
  },
  {
    title: "Отзывы",
    href: "/#reviews",
  },
  {
    title: "Контакты",
    href: "/#contacts",
  },
];


export const whyWeData = [
  {
    icon: svg_1.src,
    title: 'Уникальная <br /> материалотека',
    description: 'Авторские фасады, эксклюзивные шпоны, дизайнерские ручки — более 10000 вариантов отделок для создания вашего интерьера'
  },
  {
    icon: svg_2.src,
    title: 'Комплексное <br /> обустройство интерьера',
    description: 'От кухни до гардеробной — профессионально реализовываем дизайнерские проекты мебели любой сложности'
  },
  {
    icon: svg_3.src,
    title: 'Экспертная <br /> поддержка',
    description: 'Наши дизайнеры и конструкторы с опытом работы более 10 лет помогут воплотить все ваши идеи и создать идеальный интерьер'
  },
  {
    icon: svg_4.src,
    title: 'Безупречное качество <br /> производства',
    description: 'Полный контроль качества и возможность реализации любых дизайнерских идей благодаря собственным производственным мощностям'
  },
  {
    icon: svg_5.src,
    title: 'Комфортные <br /> шоу-румы',
    description: 'Просторные шоурмы с удобным расположением, большим выбором образцов и гостевой парковкой для комфортной работы над вашим проектом.'
  },
  {
    icon: svg_6.src,
    title: 'Надежность <br /> и безопасность',
    description: 'Более 20 лет обустраиваем интерьеры премиум-класса с гарантия до 10 лет на нашу мебель'
  }
];


export const accordionItems = [
  {
    number: '01',
    title: 'Сколько стоит мебель под заказ и от какой суммы начинаются проекты?',
    description: ' Стоимость каждого изделия зависит от размеров, конструкции и выбранных материалов, поэтому мы рассчитываем каждый проект индивидуально. В среднем стоимость одного изделия начинается от 350 000 ₽, а комплексное обустройство квартиры — от 2,5 млн ₽. '
  },
  {
    number: '02',
    title: 'Какие реальные сроки производства и установки мебели?',
    description: 'Сроки изготовления мебели напрямую зависят от выбранных материалов и в среднем составляют от 30 до 60 дней. Например, сроки изготовления гардеробной комнаты из ЛДСП значительно ниже, чем у шкафа с фасадами, покрытыми эмалью. Это связано с особенностями производственного процесса изготовления изделий, в случае с эмалью он значительно более сложный и длительный.'
  },
  {
    number: '03',
    title: 'Можете ли вы сделать мебель по готовому дизайн‑проекту моего дизайнера?',
    description: 'Да, чаще всего мы реализуем мебель по проектам дизайнеров интерьера. Перед запуском в производство мы анализируем проект на технологичность, при необходимости делаем точечные корректировки и согласуем их с вами, чтобы сохранить замысел дизайнера и обеспечить безупречный результат. '
  },
  {
    number: '04',
    title: 'Чем ваше производство отличается от небольших частных мастерских?',
    description: 'Наше производство обеспечивает иной уровень контроля качества, технологичности и сервиса, чем небольшие частные мастерские. Мы работаем по выверенным стандартам, используем промышленное оборудование и премиальные материалы с подтвержденным происхождением, гарантируя предсказуемый результат в оговоренные сроки. '
  },
  {
    number: '05',
    title: 'Какая гарантия на мебель и что в неё входит?',
    description: 'На всю корпусную мебель действует гарантия 24 месяца. На фурнитуру и комплектующие — расширенная гарантия 60 месяцев. После завершения гарантийного срока мы обеспечиваем пожизненное сервисное обслуживание наших изделий. '
  },
  {
    number: '06',
    title: 'Какой объём координации на объекте вы берёте на себя: замеры, дизайнер, подрядчики?',
    description: 'Мы полностью берём на себя техническую координацию проекта в части мебели. Замеры выполняет наш специалист с выездом на объект, далее мы взаимодействуем с вашим дизайнером, согласуя все узлы и решения по мебели. При необходимости подключаемся к коммуникации с подрядчиками на объекте (отделка, электрика, слаботочка), чтобы точно увязать мебель с инженерией и отделочными работами.'
  },
  {
    number: '07',
    title: 'Какие условия оплаты предусмотрены: аванс, сроки и поэтапные платежи?',
    description: 'Для запуска проекта в производство мы заключаем договор и принимаем аванс в размере 50% от суммы. Вторая часть оплачивается перед отгрузкой мебели, финальный платёж — после выполнения всех работ. По согласованию возможен поэтапный график платежей в рамках договора. '
  },
  {
    number: '08',
    title: 'Есть ли рассрочка или другие варианты поэтапной оплаты?',
    description: 'Да, у нас доступны рассрочка и другие варианты поэтапной оплаты. Мы сотрудничаем с банками‑партнерами, которые предоставляют кредитные и рассроченные программы, а конкретные условия вы можете уточнить у менеджера при расчете вашего проекта.  '
  },
  {
    number: '09',
    title: 'С какими материалами и фурнитурой вы работаете? ',
    description: 'Мы работаем с широким спектром материалов и фурнитуры премиального уровня. В проектах используем ЛДСП, МДФ, шпон, эмаль, алюминий, латунь, стекло, а также различные ткани и кожу, подбирая сочетания под архитектуру и задачу интерьера. Все материалы и комплектующие проходят предварительный отбор по качеству и стабильности, поэтому в работе применяются только проверенные решения. '
  },
  {
    number: '10',
    title: 'Что делать, если после установки мебели я захочу что‑то доработать или изменить?',
    description: 'После установки мы остаёмся на связи и сопровождаем проект. Если вы захотите что‑то доработать или изменить, наш менеджер и технолог предложат возможные варианты, согласуют решения и при необходимости организуют дополнительное производство и выезд монтажной бригады.'
  },
  {
    number: '11',
    title: 'Сколько лет существует ваша компания?',
    description: 'Наш салон работает в одном и том же месте уже более 25 лет. За это время мы реализовали несколько тысяч сложных интерьерных проектов, выстроили стабильное производство и сервис и продолжаем сопровождать наших клиентов годами. '
  },
]

export const mockReviews = [
  {
    id: 1,
    name: 'Никита А.',
    date: '11.12.2025',
    stars: 5,
    title: 'КУХНЯ, ШКАФЫ И ДЕТСКАЯ',
    text: 'Хочу поблагодарить всю команду за прекрасную мебель. Мы первый раз обустраивали новую квартиру и очень боялись ошибиться с выбором. Мы заказывали кухню, все шкафы и мебель в детскую комнату. Было очень удобно работать с конструктором, он быстро находил в нашем дизайн-проекте неудачные решения и предлагал как их лучше обыграть. В итоге, вся мебель вписалась в интерьер идеально...',
    textFull: 'Хочу поблагодарить всю команду за прекрасную мебель. Мы первый раз обустраивали новую квартиру и очень боялись ошибиться с выбором. Мы заказывали кухню, все шкафы и мебель в детскую комнату. Было очень удобно работать с конструктором, он быстро находил в нашем дизайн-проекте неудачные решения и предлагал как их лучше обыграть. В итоге, вся мебель вписалась в интерьер идеально, отдельное спасибо за продуманные и удобные решения для хранения, мы в восторге. Приятно, что у нас, могут так классно делать мебель! Спасибо!',
    avatar: "/reviews/person1.png"
  },
  {
    id: 2,
    name: 'Александра В.',
    date: '14.12.2025',
    stars: 5,
    title: 'ШКАФЫ И ФАСАДЫ',
    text: 'Редко у кого из производителей сейчас встретишь такое разнообразие шкафов. Обычно несколько вариантов, которые различаются только цветом и фактурой. Тут вся мебель разная, можно реализовать любую задумку дизайнера. Для нашего проекта нам предложили нестандартное решение по фасадам, которое позволило собрать все детали интерьера в единый образ...',
    textFull: 'Редко у кого из производителей сейчас встретишь такое разнообразие шкафов. Обычно несколько вариантов, которые различаются только цветом и фактурой. Тут вся мебель разная, можно реализовать любую задумку дизайнера. Для нашего проекта нам предложили нестандартное решение по фасадам, которое позволило собрать все детали интерьера в единый образ, что нас это очень порадовало. Команда работает слажено, видно, что все любят и знают свое дело. Рекомендуем.',
    avatar: "/reviews/person2.png"
  },
  {
    id: 3,
    name: 'Антон С.',
    date: '18.12.2025',
    stars: 5,
    title: 'КУХНЯ И ГАРДЕРОБНАЯ',
    text: 'Мы заказывали кухню и гардеробную в загородный дом и с самого начала чувствовали, что попали к настоящим профессионалам. Менеджер-дизайнер не просто продавал нам мебель, а буквально «проживал» с нами наш проект. Он учел все конструктивные особенности помещений, спланировал эргономичные зоны хранения и помог подобрать материалы...',
    textFull: 'Мы заказывали кухню и гардеробную в загородный дом и с самого начала чувствовали, что попали к настоящим профессионалам. Менеджер-дизайнер не просто продавал нам мебель, а буквально «проживал» с нами наш проект. Он учел все конструктивные особенности помещений, спланировал эргономичные зоны хранения и помог подобрать материалы, которые идеально сочетаются с общим интерьером дома. Доставка и сборка были выполнены в согласованный срок, без единой задержки. Сборщики работали предельно аккуратно, за собой всё убрали. Качество фурнитуры и сборки на высочайшем уровне. Будем обязательно рекомендовать вас всем знакомым!',
    avatar: "/reviews/person3.png"
  },
  {
    id: 4,
    name: 'Анна С.',
    date: '22.12.2025',
    stars: 5,
    title: 'СЛОЖНЫЙ ДИЗАЙН-ПРОЕКТ',
    text: 'Мы заказывали мебель по сложному дизайн проекту, поэтому для нас было очень важно найти компанию, которая учтёт все наши пожелания. После визита в салон нам стало понятно, что компания может сделать практически все, ассортимент и качество проработки впечатляют. По нашему проекту все получилось так как задумали...',
    textFull: 'Мы заказывали мебель по сложному дизайн проекту, поэтому для нас было очень важно найти компанию, которая учтёт все наши пожелания. После визита в салон нам стало понятно, что компания может сделать практически все, ассортимент и качество проработки впечатляют. По нашему проекту все получилось так как задумали, разработали фасады пол наш проект, смогли идеально подобрать цвет и реализовали всю начинку. Отдельное спасибо службе сервиса, которая чутко реагировала на все наши просьбы.'
  },
  {
    id: 5,
    name: 'Виктория М.',
    date: '10.01.2026',
    stars: 5,
    title: 'СОТРУДНИЧЕСТВО С ДИЗАЙНЕРОМ',
    text: 'Как дизайнер интерьера я очень люблю и ценю сотрудничество с компанией Nobiele Design. Отмечу возможности фабрики, очень гибкий подход и готовность реализовать не всегда простые и очевидные задачи. Это позволят нам находить нестандартные решения для наших заказчиков. При работе с проектами могут возникать разные непредвиденные ситуации...',
    textFull: 'Как дизайнер интерьера я очень люблю и ценю сотрудничество с компанией Nobiele Design. Отмечу возможности фабрики, очень гибкий подход и готовность реализовать не всегда простые и очевидные задачи. Это позволят нам находить нестандартные решения для наших заказчиков. При работе с проектами могут возникать разные непредвиденные ситуации, но я всегда могу быть уверена, что решение будет найдено и клиенты останутся довольны. Желаю успехов!'
  },
  {
    id: 6,
    name: 'Илья К.',
    date: '15.01.2026',
    stars: 5,
    title: 'ПРИХОЖАЯ И ШКАФ В СПАЛЬНЮ',
    text: 'Долго выбирали, где заказать мебель для новой квартиры. В итоге остановились на салоне на Соколе. Делали прихожую и шкаф в спальню. Очень понравилось работать с дизайнером Ольгой Зайцевой - спокойно обсуждали каждую мелочь, несколько раз меняли внутренне наполнение, практически начиная с нуля. Ольга всегда помогала...',
    textFull: 'Долго выбирали, где заказать мебель для новой квартиры. В итоге остановились на салоне на Соколе. Делали прихожую и шкаф в спальню. Очень понравилось работать с дизайнером Ольгой Зайцевой - спокойно обсуждали каждую мелочь, несколько раз меняли внутренне наполнение, практически начиная с нуля. Ольга всегда помогала и давала интересные и грамотные советы, работать было очень комфортно. Да, изготовление заняло время, зато в итоге получили именно то, что хотели.'
  },
  {
    id: 7,
    name: 'Мария К.',
    date: '20.01.2026',
    stars: 5,
    title: 'КУХНЯ НА ЗАКАЗ',
    text: 'Заказала кухню в компании Нобиле. В первую очередь хочу выразить огромнейшую благодарность менеджеру Надежде. Подход удивительный, без навязывания услуг, все очень подробно. Очень внимательно выслушала мои сбивчивые пожелания. Также Надежда предложила просто замечательные идеи по организации пространства. Визуализация получилась впечатляюще реалистичной...',
    textFull: 'Заказала кухню в компании Нобиле. В первую очередь хочу выразить огромнейшую благодарность менеджеру Надежде. Подход удивительный, без навязывания услуг, все очень подробно. Очень внимательно выслушала мои сбивчивые пожелания. Также Надежда предложила просто замечательные идеи по организации пространства. Визуализация получилась впечатляюще реалистичной.\n\nДалее мы согласовали удобный день для замера, ориентировочную дату готовности, а также Надежда подсказала, какая из бригад лучше справится с нашим заказом. Эта бригада и приехала на сборку. В итоге кухня собрана из качественных материалов, МДФ фасады выглядят очень дорого и шикарно, много подсветки, множество коммуникаций. Все подключено и работает как часы.\n\nИтак: мы получили не просто кухонные шкафы, а светлое, функциональное пространство, где собирается вся моя большая семья. Я 100% рекомендую эту компанию. Я не ошиблась в выборе и очень этому рада!!!!!!!'
  },
  {
    id: 8,
    name: 'Ольга Ж.',
    date: '25.01.2026',
    stars: 5,
    title: 'МЕБЛИРОВКА КВАРТИРЫ И ВАННОЙ',
    text: 'В компанию «Nobiele Design» мы обращались три раза : в 2017 году заказывали мебель в квартиру дочери, в 2019 году на дачу. До сих пор она удобна и радует. Решили и в 2024 году обратится в Nobile для меблировки 2-комнатной квартиры и ванной комнаты ( 7 позиций). Дизайнер Светлана спроектировала очень подробно и точно все шкафы и полки...',
    textFull: 'В компанию «Nobiele Design» мы обращались три раза : в 2017 году заказывали мебель в квартиру дочери, в 2019 году на дачу. До сих пор она удобна и радует. Решили и в 2024 году обратится в Nobile для меблировки 2-комнатной квартиры и ванной комнаты ( 7 позиций). Дизайнер Светлана спроектировала очень подробно и точно все шкафы и полки. Прорабатывалось все, до самых маленьких деталей. После монтажа, обнаружили, не достающую линию на фасаде шкафа. И пока мы недели две думали оставить так или переделать, сервис менеджер сообщила нам, что готовы новые фасадные двери. Привезли и переустановили. Хотим отметить пунктуальность доставки. Доставщики работают четко и аккуратно. Очень довольны работой монтажника Максима, специалист высокого уровня. Знает все нюансы фурнитуры. Изготовленной мебелью мы очень довольны. Радует и внутреннее наполнение, и фурнитура, эффектно и глянцевое и матовое покрытие фасадов. Мы очень довольны результатом. Рекомендуем сотрудничество с Нобиле. Даже если и возникали трудности, они решились с вниманием и уважением к Заказчику.'
  },
  {
    id: 9,
    name: 'Елизавета Г.',
    date: '28.01.2026',
    stars: 5,
    title: 'ГАРДЕРОБНЫЕ КОМНАТЫ',
    text: 'Хочу выразить огромную благодарность компании «Нобиле» за прекрасные гардеробные комнаты! Мы заказали две их, и весь процесс — от первого визита в салон до завершения установки — прошел на высоком уровне. Отдельное спасибо менеджеру Ирине за профессионализм и умение точно понять наши пожелания. Также хочу отметить менеджера по сервису...',
    textFull: 'Хочу выразить огромную благодарность компании «Нобиле» за прекрасные гардеробные комнаты! Мы заказали две их, и весь процесс — от первого визита в салон до завершения установки — прошел на высоком уровне.\n\nОтдельное спасибо менеджеру Ирине за профессионализм и умение точно понять наши пожелания.\nТакже хочу отметить менеджера по сервису, которая сопровождала наш проект от производства до монтажа. Она разделяла наши переживания, оперативно решала все возникшие вопросы и всегда была на связи, не исчезая и не забывая о нас.\nТак же хочу отметить бригаду сборщиков под руководством Виктора! Ребята — настоящие профессионалы: работали быстро, чисто и очень аккуратно. Ни лишнего шума, ни пыли.\nВ итоге мы получили продуманные до мелочей гардеробные, где пространство хорошо организовано. Они не только невероятно красивые, но и очень удобные в использовании.\nНесмотря на небольшую задержку в сроках, результат того однозначно стоил!\nРекомендую «Нобиле» как компанию-профессионала. Всем сотрудникам — спасибо за отличную работу!'
  },
  {
    id: 10,
    name: 'Наталья И.',
    date: '02.02.2026',
    stars: 5,
    title: 'ПРИХОЖАЯ И СПАЛЬНЯ',
    text: 'Начну с первого впечатления, которое оставил салон в Румере. Большой, просторный, интересный, таких изделий мы не видели больше ни у кого. Много интересных решений, которые помогли нам превратить нашу прихожую и спальню в райский уголок! Качество и сервис просто огонь!!! Хотим выразить огромную благодарность компании Нобиле Дизайн...',
    textFull: 'Начну с первого впечатления, которое оставил салон в Румере. Большой, просторный, интересный, таких изделий мы не видели больше ни у кого. Много интересных решений, которые помогли нам превратить нашу прихожую и спальню в райский уголок!\n\nКачество и сервис просто огонь!!!\n\nХотим выразить огромную благодарность компании Нобиле Дизайн за отличную командную работу! Безупречная работа по изготовлению и монтажу шкафов в прихожей и спальне. С самого начала чувствовался профессионализм. Отдельное спасибо за это Ирине, которая вникла во все наши хотелки и смогла их грамотно реализовать в жизнь. Она очень подробно проконсультировала по материалам и фурнитуре. Мы выбрали ЛДСП для корпусов и зеркальные фасады для шкафа купе. Сроки изготовления были озвучены, и, что очень приятно, соблюдены.\n\nОтдельно хочу поблагодарить бригаду монтажников. Ребята приехали в оговоренное время, работали быстро и аккуратно. Не оставили после себя ни соринки. После сборки проверили работу раздвижных дверей и ящиков. Все двигается бесшумно и плавно. Шкафы получились очень вместительными и красивыми.\n\nМы абсолютно довольны всеми этапами от замера и заключения договора до монтажа. Обязательно будем рекомендовать Вас всем друзьям, знакомым и родственникам!!!'
  }
]

export const titlesMebelUTM = [
  {
    key: "mebel",
    title: "ИЗГОТОВИМ ЭКСКЛЮЗИВНУЮ МЕБЕЛЬ ПО ВАШЕМУ <br /> ДИЗАЙН-ПРОЕКТУ НА ЗАКАЗ",
    subtitle: "Получите предложение по реализации интерьера премиум-класса",
    listTitles: ["Проверим проект <br /> на реализуемость", "Согласуем <br /> технические решения <br /> с дизайнером", "Предложим лучшее <br /> решение в рамках <br /> бюджета", "Изготовим и <br /> смонтируем <br /> под ключ"],
    btnText: "Получить предложение",
  },
  {
    key: "mebelprimium",
    title: "ИЗГОТОВИМ ПРЕМИАЛЬНУЮ МЕБЕЛЬ ПО ВАШЕМУ <br /> ДИЗАЙН-ПРОЕКТУ НА ЗАКАЗ",
    subtitle: "Спроектируем мебель под размеры, стиль и задачи вашего интерьера, подберём материалы, изготовим на собственном производстве и установим одной командой.",
    listTitles: ["Индивидуальный <br /> проект", "Собственное <br/> производство", "Доставка и монтаж <br/> одной командой"],
    btnText: "Получить расчёт мебели",
  },
  {
    key: "ktchn",
    title: "Изготовим кухню и мебель премиум класса <br/> по вашему дизайн проекту",
    subtitle: "Получите предложение по реализации интерьера премиум-класса",
    listTitles: ["Проверим проект <br /> на реализуемость", "Согласуем <br /> технические решения <br /> с дизайнером", "Предложим лучшее <br /> решение в рамках <br /> бюджета", "Изготовим и <br /> смонтируем <br /> под ключ"],
    btnText: "Получить предложение",
  },
  {
    key: "mebelwardrobe",
    title: "Создадим премиальную гардеробную, <br/> продуманную под ваш образ жизни",
    subtitle: "Рассчитаем необходимое количество секций, полок и систем хранения, подберём материалы и используем каждый метр пространства.",

    listTitles: ["Хранение под <br/> ваши задачи", "Индивидуальная <br/> планировка", "Материалы <br/> премиального уровня"],
    btnText: "Рассчитать гардеробную",
  },
  {
    key: "mebelcloset",
    title: "Изготовим премиальные встроенные шкафы <br /> точно под геометрию вашего интерьера",
    subtitle: "Учтём размеры ниш, высоту потолков, плинтусы и коммуникации, чтобы шкаф выглядел частью архитектуры помещения.",
    listTitles: ["Точность <br/> деталей", "Индивидуальные <br/> фасады", "Собственное <br/> производство"],
    btnText: "Получить расчёт шкафа",
  },

]

export const utmKeys = ["utm_source", "utm_medium", "utm_campaign", "utm_term", "utm_content"];